$(function () {
    $.getJSON('/echarts/pie',function(lineoption){
    var lineoption = {
        title : {
            text: '船舶统计'
        },
        tooltip : {
            trigger: 'axis'
        },
        legend: {
            data:['大吨位','小吨位']
        },
        grid:{
            x:40,
            x2:40,
            y2:24
        },
        calculable : true,
        xAxis : [
            {
                type : 'category',
                boundaryGap : false,
                data : ['地区一','地区二','地区三','地区四','地区五','地区六','地区七']
            }
        ],
        yAxis : [
            {
                type : 'value',
                axisLabel : {
                    formatter: '{value} °C'
                }
            }
        ],
        series : [
            {
                name:'大吨位',
                type:'line',
                data:[110, 110, 150, 130, 120, 130, 100],
                markPoint : {
                    data : [
                        {type : 'max', name: '最大值'},
                        {type : 'min', name: '最小值'}
                    ]
                },
                markLine : {
                    data : [
                        {type : 'average', name: '平均值'}
                    ]
                }
            },
            {
                name:'小吨位',
                type:'line',
                data:[1, -2, 2, 5, 3, 2, 0],
                markPoint : {
                    data : [
                        {name : '周最小', value : -2, xAxis: 1, yAxis: -1.5}
                    ]
                },
                markLine : {
                    data : [
                        {type : '出货总量', name : '吨位T'}
                    ]
                }
            }
        ]
    };

        // lineoption = {
        //     title: {
        //         text: '船舶统计'
        //     },
        //     tooltip : {
        //         trigger: 'axis'
        //     },
        //     legend: {
        //         data:['吨位']
        //     },
        //     calculable : true,
        //     xAxis: {
        //         data: ["散货船","液货船","石油化学品船","集装箱船","客船","油轮"]
        //     },
        //     yAxis: {data:null},
        //     series: [{
        //         name: '出货量',
        //         type: 'pie',
        //         data: [5, 20, 36, 10, 10, 20]
        //     }]
        // };

    })

//start
    var barChart = echarts.init(document.getElementById("echarts-bar-chart"));
    var baroption = {
        title : {
            text: '地区货运量和货物周转量'
        },
        tooltip : {
            trigger: 'axis'
        },
        legend: {
            data:['货运量','货物周转量']
        },
        grid:{
            x:30,
            x2:40,
            y2:24
        },
        calculable : true,
        xAxis : [
            {
                type : 'category',
                data : ['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月','12月']
            }
        ],
        yAxis : [
            {
                type : 'value'
            }
        ],
        series : [
            {
                name:'货运量',
                type:'bar',
                data:[20, 49, 70, 232, 256, 767, 1356, 1622, 326, 200, 64, 3.],
                markPoint : {
                    data : [
                        {type : 'max', name: '最大值'},
                        {type : 'min', name: '最小值'}
                    ]
                },
                markLine : {
                    data : [
                        {type : 'average', name: '平均值'}
                    ]
                }
            },
            {
                name:'周转量',
                type:'bar',
                data:[26, 59, 90, 264, 287, 707, 1756, 1822, 487, 188, 60, 23],
                markPoint : {
                    data : [
                        {name : '年最高', value : 1822, xAxis: 7, yAxis: 183, symbolSize:18},
                        {name : '年最低', value : 23, xAxis: 11, yAxis: 3}
                    ]
                },
                markLine : {
                    data : [
                        {type : 'average', name : '平均值'}
                    ]
                }
            }
        ]
    };
    barChart.setOption(baroption);

    window.onresize = barChart.resize;
    //end

    var scatterChart = echarts.init(document.getElementById("echarts-scatter-chart"));
    var scatteroption = {
        title : {
            text: '来往船舶分布',
            subtext: '数据来源时间2019-10-18'
        },
        tooltip : {
            trigger: 'axis',
            showDelay : 0,
            axisPointer:{
                type : 'cross',
                lineStyle: {
                    type : 'dashed',
                    width : 1
                }
            }
        },
        legend: {
            data:['货船','油轮']
        },
        grid:{
            x:45,
            x2:40,
            y2:24
        },
        xAxis : [
            {
                type : 'value',
                scale:true,
                axisLabel : {
                    formatter: '{value} 米'
                }
            }
        ],
        yAxis : [
            {
                type : 'value',
                scale:true,
                axisLabel : {
                    formatter: '{value} 艘'
                }
            }
        ],
        series : [
            {
                name:'货船',
                type:'scatter',
                tooltip : {
                    trigger: 'item',
                    formatter : function (params) {
                        if (params.value.length > 1) {
                            return params.seriesName + ' :<br/>'
                               + params.value[0] + '米 '
                               + params.value[1] + '艘 ';
                        }
                        else {
                            return params.seriesName + ' :<br/>'
                               + params.name + ' : '
                               + params.value + 'kg ';
                        }
                    }
                },
                data: [[61.2, 51.6], [67.5, 59.0], [59.5, 49.2], [57.0, 63.0], [55.8, 53.6],
                    [70.0, 59.0], [59.1, 47.6], [66.0, 69.8], [76.2, 66.8], [60.2, 75.2],
                    [72.5, 55.2], [70.9, 54.2], [72.9, 62.5], [53.4, 42.0], [60.0, 50.0],
                    [47.2, 49.8], [68.2, 49.2], [75.0, 73.2], [57.0, 47.8], [67.6, 68.8],
                    [59.5, 50.6], [75.0, 82.5], [66.8, 57.2], [76.5, 87.8], [70.2, 72.8],
                    [174.0, 54.5], [73.0, 59.8], [79.9, 67.3], [70.5, 67.8], [60.0, 47.0],
                    [154.4, 46.2], [62.0, 55.0], [76.5, 83.0], [60.0, 54.4], [52.0, 45.8],
                    [162.1, 53.6], [70.0, 73.2], [60.2, 52.1], [61.3, 67.9], [66.4, 56.6],
                    [168.9, 62.3], [63.8, 58.5], [67.6, 54.5], [60.0, 50.2], [61.3, 60.3],
                    [167.6, 58.3], [65.1, 56.2], [60.0, 50.2], [70.0, 72.9], [57.5, 59.8],
                    [167.6, 61.0], [60.7, 69.1], [63.2, 55.9], [52.4, 46.5], [57.5, 54.3],
                    [168.3, 54.8], [80.3, 60.7], [65.5, 60.0], [65.0, 62.0], [64.5, 60.3],
                    [156.0, 52.7], [60.0, 74.3], [63.0, 62.0], [65.7, 73.1], [61.0, 80.0],
                    [162.0, 54.7], [66.0, 53.2], [74.0, 75.7], [72.7, 61.1], [67.6, 55.7],
                    [151.1, 48.7], [64.5, 52.3], [63.5, 50.0], [52.0, 59.3], [69.0, 62.5],
                    [164.0, 55.7], [61.2, 54.8], [55.0, 45.9], [70.0, 70.6], [76.2, 67.2],
                    [170.0, 69.4], [62.5, 58.2], [70.3, 64.8], [64.1, 71.6], [69.5, 52.8],
                    [163.2, 59.8], [54.5, 49.0], [59.8, 50.0], [73.2, 69.2], [70.0, 55.9],
                    [161.4, 63.4], [69.0, 58.2], [66.2, 58.6], [59.4, 45.7], [62.5, 52.2],
                    [159.0, 48.6], [62.8, 57.8], [59.0, 55.6], [79.8, 66.8], [62.9, 59.4],
                    [161.0, 53.6], [51.1, 73.2], [68.2, 53.4], [68.9, 69.0], [73.2, 58.4],
                    [171.8, 56.2], [78.0, 70.6], [64.3, 59.8], [63.0, 72.0], [68.5, 65.2],
                    [166.8, 56.6], [72.7, 105.2], [63.5, 51.8], [69.4, 63.4], [67.8, 59.0],
                    [159.5, 47.6], [67.6, 63.0], [61.2, 55.2], [60.0, 45.0], [63.2, 54.0],
                    [162.2, 50.2], [61.3, 60.2], [49.5, 44.8], [57.5, 58.8], [63.2, 56.4],
                    [172.7, 62.0], [55.0, 49.2], [56.5, 67.2], [64.0, 53.8], [60.9, 54.4],
                    [62.8, 58.0], [67.0, 59.8], [60.0, 54.8], [60.0, 43.2], [68.9, 60.5],
                    [58.2, 46.4], [56.0, 64.4], [60.0, 48.8], [67.1, 62.2], [58.0, 55.5],
                    [67.6, 57.8], [56.0, 54.6], [62.1, 59.2], [73.4, 52.7], [59.8, 53.2],
                    [70.5, 64.5], [59.2, 51.8], [57.5, 56.0], [61.3, 63.6], [62.6, 63.2],
                    [60.0, 59.5], [68.9, 56.8], [65.1, 64.1], [62.6, 50.0], [65.1, 72.3],
                    [66.4, 55.0], [60.0, 55.9], [52.4, 60.4], [70.2, 69.1], [62.6, 84.5],
                    [70.2, 55.9], [58.8, 55.5], [72.7, 69.5], [67.6, 76.4], [62.6, 61.4],
                    [67.6, 65.9], [56.2, 58.6], [75.2, 66.8], [72.1, 56.6], [62.6, 58.6],
                    [60.0, 55.9], [65.1, 59.1], [82.9, 81.8], [66.4, 70.7], [65.1, 56.8],
                    [77.8, 60.0], [65.1, 58.2], [75.3, 72.7], [54.9, 54.1], [58.8, 49.1],
                    [72.7, 75.9], [68.9, 55.0], [61.3, 57.3], [67.6, 55.0], [65.1, 65.5],
                    [75.3, 65.5], [57.5, 48.6], [63.8, 58.6], [67.6, 63.6], [65.1, 55.2],
                    [65.1, 62.7], [68.9, 56.6], [62.6, 53.9], [64.5, 63.2], [76.5, 73.6],
                    [68.9, 62.0], [75.3, 63.6], [59.4, 53.2], [60.0, 53.4], [70.2, 55.0],
                    [62.6, 70.5], [67.6, 54.5], [62.6, 54.5], [60.7, 55.9], [60.0, 59.0],
                    [57.5, 63.6], [62.6, 54.5], [52.4, 47.3], [70.2, 67.7], [65.1, 80.9],
                    [72.7, 70.5], [65.1, 60.9], [70.2, 63.6], [70.2, 54.5], [70.2, 59.1],
                    [61.3, 70.5], [67.6, 52.7], [67.6, 62.7], [65.1, 86.3], [62.6, 66.4],
                    [52.4, 67.3], [68.9, 63.0], [70.2, 73.6], [75.2, 62.3], [75.2, 57.7],
                    [60.0, 55.4], [65.1, 104.1], [74.0, 55.5], [70.2, 77.3], [60.0, 80.5],
                    [67.6, 64.5], [67.6, 72.3], [67.6, 61.4], [54.9, 58.2], [62.6, 81.8],
                    [75.3, 63.6], [71.4, 53.4], [57.5, 54.5], [65.1, 53.6], [60.0, 60.0],
                    [74.0, 73.6], [62.6, 61.4], [74.0, 55.5], [62.6, 63.6], [61.3, 60.9],
                    [56.2, 60.0], [49.9, 46.8], [69.5, 57.3], [60.0, 64.1], [75.3, 63.6],
                    [69.5, 67.3], [60.0, 75.5], [72.7, 68.2], [62.6, 61.4], [57.5, 76.8],
                    [76.5, 71.8], [64.4, 55.5], [60.7, 48.6], [74.0, 66.4], [63.8, 67.3]
                ],
                markPoint : {
                    data : [
                        {type : 'max', name: '最大值'},
                        {type : 'min', name: '最小值'}
                    ]
                },
                markLine : {
                    data : [
                        {type : 'average', name: '平均值'}
                    ]
                }
            },
            {
                name:'油轮',
                type:'scatter',
                tooltip : {
                    trigger: 'item',
                    formatter : function (params) {
                        if (params.value.length > 1) {
                            return params.seriesName + ' :<br/>'
                               + params.value[0] + '艘 '
                               + params.value[1] + '米 ';
                        }
                        else {
                            return params.seriesName + ' :<br/>'
                               + params.name + ' : '
                               + params.value + '米 ';
                        }
                    }
                },
                data: [[174.0, 65.6], [175.3, 71.8], [193.5, 80.7], [186.5, 72.6], [187.2, 78.8],
                    [81.5, 74.8], [184.0, 86.4], [184.5, 78.4], [175.0, 62.0], [184.0, 81.6],
                    [80.0, 76.6], [177.8, 83.6], [192.0, 90.0], [176.0, 74.6], [174.0, 71.0],
                    [84.0, 79.6], [192.7, 93.8], [171.5, 70.0], [173.0, 72.4], [176.0, 85.9],
                    [76.0, 78.8], [180.5, 77.8], [172.7, 66.2], [176.0, 86.4], [173.5, 81.8],
                    [78.0, 89.6], [180.3, 82.8], [180.3, 76.4], [164.5, 63.2], [173.0, 60.9],
                    [83.5, 74.8], [175.5, 70.0], [188.0, 72.4], [189.2, 84.1], [172.8, 69.1],
                    [70.0, 59.5], [182.0, 67.2], [170.0, 61.3], [177.8, 68.6], [184.2, 80.1],
                    [86.7, 87.8], [171.4, 84.7], [172.7, 73.4], [175.3, 72.1], [180.3, 82.6],
                    [82.9, 88.7], [188.0, 84.1], [177.2, 94.1], [172.1, 74.9], [167.0, 59.1],
                    [69.5, 75.6], [174.0, 86.2], [172.7, 75.3], [182.2, 87.1], [164.1, 55.2],
                    [63.0, 57.0], [171.5, 61.4], [184.2, 76.8], [174.0, 86.8], [174.0, 72.2],
                    [77.0, 71.6], [186.0, 84.8], [167.0, 68.2], [171.8, 66.1], [182.0, 72.0],
                    [67.0, 64.6], [177.8, 74.8], [164.5, 70.0], [192.0, 101.6], [175.5, 63.2],
                    [71.2, 79.1], [181.6, 78.9], [167.4, 67.7], [181.1, 66.0], [177.0, 68.2],
                    [74.5, 63.9], [177.5, 72.0], [170.5, 56.8], [182.4, 74.5], [197.1, 90.9],
                    [80.1, 93.0], [175.5, 80.9], [180.6, 72.7], [184.4, 68.0], [175.5, 70.9],
                    [80.6, 72.5], [177.0, 72.5], [177.1, 83.4], [181.6, 75.5], [176.5, 73.0],
                    [75.0, 70.2], [174.0, 73.4], [165.1, 70.5], [177.0, 68.9], [192.0, 102.3],
                    [76.5, 68.4], [169.4, 65.9], [182.1, 75.7], [179.8, 84.5], [175.3, 87.7],
                    [84.9, 86.4], [177.3, 73.2], [167.4, 53.9], [178.1, 72.0], [168.9, 55.5],
                    [57.2, 58.4], [180.3, 83.2], [170.2, 72.7], [177.8, 64.1], [172.7, 72.3],
                    [65.1, 65.0], [186.7, 86.4], [165.1, 65.0], [174.0, 88.6], [175.3, 84.1],
                    [85.4, 66.8], [177.8, 75.5], [180.3, 93.2], [180.3, 82.7], [177.8, 58.0],
                    [77.8, 79.5], [177.8, 78.6], [177.8, 71.8], [177.8, 116.4], [163.8, 72.2],
                    [88.0, 83.6], [198.1, 85.5], [175.3, 90.9], [166.4, 85.9], [190.5, 89.1],
                    [66.4, 75.0], [177.8, 77.7], [179.7, 86.4], [172.7, 90.9], [190.5, 73.6],
                    [85.4, 76.4], [168.9, 69.1], [167.6, 84.5], [175.3, 64.5], [170.2, 69.1],
                    [90.5, 108.6], [177.8, 86.4], [190.5, 80.9], [177.8, 87.7], [184.2, 94.5],
                    [76.5, 80.2], [177.8, 72.0], [180.3, 71.4], [171.4, 72.7], [172.7, 84.1],
                    [72.7, 76.8], [177.8, 63.6], [177.8, 80.9], [182.9, 80.9], [170.2, 85.5],
                    [67.6, 68.6], [175.3, 67.7], [165.1, 66.4], [185.4, 102.3], [181.6, 70.5],
                    [72.7, 95.9], [190.5, 84.1], [179.1, 87.3], [175.3, 71.8], [170.2, 65.9],
                    [93.0, 95.9], [171.4, 91.4], [177.8, 81.8], [177.8, 96.8], [167.6, 69.1],
                    [67.6, 82.7], [180.3, 75.5], [182.9, 79.5], [176.5, 73.6], [186.7, 91.8],
                    [88.0, 84.1], [188.0, 85.9], [177.8, 81.8], [174.0, 82.5], [177.8, 80.5],
                    [71.4, 70.0], [185.4, 81.8], [185.4, 84.1], [188.0, 90.5], [188.0, 91.4],
                    [82.9, 89.1], [176.5, 85.0], [175.3, 69.1], [175.3, 73.6], [188.0, 80.5],
                    [88.0, 82.7], [175.3, 86.4], [170.5, 67.7], [179.1, 92.7], [177.8, 93.6],
                    [75.3, 70.9], [182.9, 75.0], [170.8, 93.2], [188.0, 93.2], [180.3, 77.7],
                    [77.8, 61.4], [185.4, 94.1], [168.9, 75.0], [185.4, 83.6], [180.3, 85.5],
                    [74.0, 73.9], [167.6, 66.8], [182.9, 87.3], [160.0, 72.3], [180.3, 88.6],
                    [67.6, 75.5], [186.7, 101.4], [175.3, 91.1], [175.3, 67.3], [175.9, 77.7],
                    [75.3, 81.8], [179.1, 75.5], [181.6, 84.5], [177.8, 76.6], [182.9, 85.0],
                    [77.8, 102.5], [184.2, 77.3], [179.1, 71.8], [176.5, 87.9], [188.0, 94.3],
                    [74.0, 70.9], [167.6, 64.5], [170.2, 77.3], [167.6, 72.3], [188.0, 87.3],
                    [74.0, 80.0], [176.5, 82.3], [180.3, 73.6], [167.6, 74.1], [188.0, 85.9],
                    [80.3, 73.2], [167.6, 76.3], [183.0, 65.9], [183.0, 90.9], [179.1, 89.1],
                    [70.2, 62.3], [177.8, 82.7], [179.1, 79.1], [190.5, 98.2], [177.8, 84.1],
                    [80.3, 83.2], [180.3, 83.2]
                ],
                markPoint : {
                    data : [
                        {type : 'max', name: '最大值'},
                        {type : 'min', name: '最小值'}
                    ]
                },
                markLine : {
                    data : [
                        {type : 'average', name: '平均值'}
                    ]
                }
            }
        ]
    };
    scatterChart.setOption(scatteroption);
    $(window).resize(scatterChart.resize);


    var kChart = echarts.init(document.getElementById("echarts-k-chart"));
    var koption = {
        title : {
            text: '2019年上半年来往船舶数量'
        },
        tooltip : {
            trigger: 'axis',
            formatter: function (params) {
                var res = params[0].seriesName + ' ' + params[0].name;
                res += '<br/>  一季度 : ' + params[0].value[0] + '  最高 : ' + params[0].value[3];
                res += '<br/>  二季度 : ' + params[0].value[1] + '  最低 : ' + params[0].value[2];
                return res;
            }
        },
        legend: {
            data:['数量']
        },
        grid:{
            x:40,
            x2:2
        },
        dataZoom : {
            show : true,
            realtime: true,
            start : 50,
            end : 100
        },
        xAxis : [
            {
                type : 'category',
                boundaryGap : true,
                axisTick: {onGap:false},
                splitLine: {show:false},
                data : [
                    "2019/1/24", "2019/1/25", "2019/1/28", "2019/1/29", "2019/1/30",
                    "2019/1/31", "2019/2/1", "2019/2/4", "2019/2/5", "2019/2/6",
                    "2019/2/7", "2019/2/8", "2019/2/18", "2019/2/19", "2019/2/20",
                    "2019/2/21", "2019/2/22", "2019/2/25", "2019/2/26", "2019/2/27",
                    "2019/2/28", "2019/3/1", "2019/3/4", "2019/3/5", "2019/3/6",
                    "2019/3/7", "2019/3/8", "2019/3/11", "2019/3/12", "2019/3/13",
                    "2019/3/14", "2019/3/15", "2019/3/18", "2019/3/19", "2019/3/20",
                    "2019/3/21", "2019/3/22", "2019/3/25", "2019/3/26", "2019/3/27",
                    "2019/3/28", "2019/3/29", "2019/4/1", "2019/4/2", "2019/4/3",
                    "2019/4/8", "2019/4/9", "2019/4/10", "2019/4/11", "2019/4/12",
                    "2019/4/15", "2019/4/16", "2019/4/17", "2019/4/18", "2019/4/19",
                    "2019/4/22", "2019/4/23", "2019/4/24", "2019/4/25", "2019/4/26",
                    "2019/5/2", "2019/5/3", "2019/5/6", "2013/5/7", "2019/5/8",
                    "2019/5/9", "2019/5/10", "2019/5/13", "2013/5/14", "2019/5/15",
                    "2019/5/16", "2019/5/17", "2019/5/20", "2019/5/21", "2019/5/22",
                    "2013/5/23", "2013/5/24", "2019/5/27", "2019/5/28", "2019/5/29",
                    "2013/5/30", "2013/5/31", "2019/6/3", "2019/6/4", "2019/6/5",
                    "2019/6/6", "2019/6/7", "2019/6/13"
                ]
            }
        ],
        yAxis : [
            {
                type : 'value',
                scale:true,
                boundaryGap: [0.01, 0.01]
            }
        ],
        series : [
            {
                name:'数量',
                type:'k',
                data:[ // 开盘，收盘，最低，最高
                    [2320.26,2302.6,2287.3,2362.94],
                    [2300,2291.3,2288.26,2308.38],
                    [2295.35,2346.5,2295.35,2346.92],
                    [2347.22,2358.98,2337.35,2363.8],
                    [2360.75,2382.48,2347.89,2383.76],
                    [2383.43,2385.42,2371.23,2391.82],
                    [2377.41,2419.02,2369.57,2421.15],
                    [2425.92,2428.15,2417.58,2440.38],
                    [2411,2433.13,2403.3,2437.42],
                    [2432.68,2434.48,2427.7,2441.73],
                    [2430.69,2418.53,2394.22,2433.89],
                    [2416.62,2432.4,2414.4,2443.03],
                    [2441.91,2421.56,2415.43,2444.8],
                    [2420.26,2382.91,2373.53,2427.07],
                    [2383.49,2397.18,2370.61,2397.94],
                    [2378.82,2325.95,2309.17,2378.82],
                    [2322.94,2314.16,2308.76,2330.88],
                    [2320.62,2325.82,2315.01,2338.78],
                    [2313.74,2293.34,2289.89,2340.71],
                    [2297.77,2313.22,2292.03,2324.63],
                    [2322.32,2365.59,2308.92,2366.16],
                    [2364.54,2359.51,2330.86,2369.65],
                    [2332.08,2273.4,2259.25,2333.54],
                    [2274.81,2326.31,2270.1,2328.14],
                    [2333.61,2347.18,2321.6,2351.44],
                    [2340.44,2324.29,2304.27,2352.02],
                    [2326.42,2318.61,2314.59,2333.67],
                    [2314.68,2310.59,2296.58,2320.96],
                    [2309.16,2286.6,2264.83,2333.29],
                    [2282.17,2263.97,2253.25,2286.33],
                    [2255.77,2270.28,2253.31,2276.22],
                    [2269.31,2278.4,2250,2312.08],
                    [2267.29,2240.02,2239.21,2276.05],
                    [2244.26,2257.43,2232.02,2261.31],
                    [2257.74,2317.37,2257.42,2317.86],
                    [2318.21,2324.24,2311.6,2330.81],
                    [2321.4,2328.28,2314.97,2332],
                    [2334.74,2326.72,2319.91,2344.89],
                    [2318.58,2297.67,2281.12,2319.99],
                    [2299.38,2301.26,2289,2323.48],
                    [2273.55,2236.3,2232.91,2273.55],
                    [2238.49,2236.62,2228.81,2246.87],
                    [2229.46,2234.4,2227.31,2243.95],
                    [2234.9,2227.74,2220.44,2253.42],
                    [2232.69,2225.29,2217.25,2241.34],
                    [2196.24,2211.59,2180.67,2212.59],
                    [2215.47,2225.77,2215.47,2234.73],
                    [2224.93,2226.13,2212.56,2233.04],
                    [2236.98,2219.55,2217.26,2242.48],
                    [2218.09,2206.78,2204.44,2226.26],
                    [2199.91,2181.94,2177.39,2204.99],
                    [2169.63,2194.85,2165.78,2196.43],
                    [2195.03,2193.8,2178.47,2197.51],
                    [2181.82,2197.6,2175.44,2206.03],
                    [2201.12,2244.64,2200.58,2250.11],
                    [2236.4,2242.17,2232.26,2245.12],
                    [2242.62,2184.54,2182.81,2242.62],
                    [2187.35,2218.32,2184.11,2226.12],
                    [2213.19,2199.31,2191.85,2224.63],
                    [2203.89,2177.91,2173.86,2210.58],
                    [2170.78,2174.12,2161.14,2179.65],
                    [2179.05,2205.5,2179.05,2222.81],
                    [2212.5,2231.17,2212.5,2236.07],
                    [2227.86,2235.57,2219.44,2240.26],
                    [2242.39,2246.3,2235.42,2255.21],
                    [2246.96,2232.97,2221.38,2247.86],
                    [2228.82,2246.83,2225.81,2247.67],
                    [2247.68,2241.92,2231.36,2250.85],
                    [2238.9,2217.01,2205.87,2239.93],
                    [2217.09,2224.8,2213.58,2225.19],
                    [2221.34,2251.81,2210.77,2252.87],
                    [2249.81,2282.87,2248.41,2288.09],
                    [2286.33,2299.99,2281.9,2309.39],
                    [2297.11,2305.11,2290.12,2305.3],
                    [2303.75,2302.4,2292.43,2314.18],
                    [2293.81,2275.67,2274.1,2304.95],
                    [2281.45,2288.53,2270.25,2292.59],
                    [2286.66,2293.08,2283.94,2301.7],
                    [2293.4,2321.32,2281.47,2322.1],
                    [2323.54,2324.02,2321.17,2334.33],
                    [2316.25,2317.75,2310.49,2325.72],
                    [2320.74,2300.59,2299.37,2325.53],
                    [2300.21,2299.25,2294.11,2313.43],
                    [2297.1,2272.42,2264.76,2297.1],
                    [2270.71,2270.93,2260.87,2276.86],
                    [2264.43,2242.11,2240.07,2266.69],
                    [2242.26,2210.9,2205.07,2250.63],
                    [2190.1,2148.35,2126.22,2190.1]
                ]
            }
        ]
    };
    kChart.setOption(koption);
    $(window).resize(kChart.resize);

    var pieChart = echarts.init(document.getElementById("echarts-pie-chart"));
    var pieoption = {
        title : {
            text: '航行线路',
            subtext: '航线',
            x:'center'
        },
        tooltip : {
            trigger: 'item',
            formatter: "{a} <br/>{b} : {c} ({d}%)"
        },
        legend: {
            orient : 'vertical',
            x : 'left',
            data:['1000042','100043','1000044','1000045','1000046']
        },
        calculable : true,
        series : [
            {
                name:'航行线路',
                type:'pie',
                radius : '55%',
                center: ['50%', '60%'],
                data:[
                    {value:335, name:'美国航线'},
                    {value:310, name:'英国航线'},
                    {value:234, name:'新加坡航线'},
                    {value:135, name:'印尼航线'},
                    {value:1548, name:'韩国航线'}
                ]
            }
        ]
    };
    pieChart.setOption(pieoption);
    $(window).resize(pieChart.resize);

    var radarChart = echarts.init(document.getElementById("echarts-radar-chart"));
    var radaroption = {
        title : {
            text: '作业 vs 航行',
            subtext: '对比'
        },
        tooltip : {
            trigger: 'axis'
        },
        legend: {
            orient : 'vertical',
            x : 'right',
            y : 'bottom',
            data:['1000031','1000032']
        },
        polar : [
           {
               indicator : [
                   { text: '2011', max: 6000},
                   { text: '2012', max: 16000},
                   { text: '2013', max: 30000},
                   { text: '2014', max: 38000},
                   { text: '2015', max: 52000},
                   { text: '2016', max: 25000}
                ]
            }
        ],
        calculable : true,
        series : [
            {
                name: '1000021 vs 1000022',
                type: 'radar',
                data : [
                    {
                        value : [4300, 10000, 28000, 35000, 50000, 19000],
                        name : '1000023'
                    },
                     {
                        value : [5000, 14000, 28000, 31000, 42000, 21000],
                        name : '1000024'
                    }
                ]
            }
        ]
    };

    radarChart.setOption(radaroption);
    $(window).resize(radarChart.resize);
    //
    // var mapChart = echarts.init(document.getElementById("echarts-map-chart"));
    // var mapoption = {
    //     title : {
    //         text: 'iphone销量',
    //         subtext: '纯属虚构',
    //         x:'center'
    //     },
    //     tooltip : {
    //         trigger: 'item'
    //     },
    //     legend: {
    //         orient: 'vertical',
    //         x:'left',
    //         data:['iphone3','iphone4','iphone5']
    //     },
    //     dataRange: {
    //         min: 0,
    //         max: 2500,
    //         x: 'left',
    //         y: 'bottom',
    //         text:['高','低'],           // 文本，默认为数值文本
    //         calculable : true
    //     },
    //     toolbox: {
    //         show: true,
    //         orient : 'vertical',
    //         x: 'right',
    //         y: 'center',
    //         feature : {
    //             mark : {show: true},
    //             dataView : {show: true, readOnly: false},
    //             restore : {show: true},
    //             saveAsImage : {show: true}
    //         }
    //     },
    //     roamController: {
    //         show: true,
    //         x: 'right',
    //         mapTypeControl: {
    //             'china': true
    //         }
    //     },
    //     series : [
    //         {
    //             name: 'iphone3',
    //             type: 'map',
    //             mapType: 'china',
    //             roam: false,
    //             itemStyle:{
    //                 normal:{label:{show:true}},
    //                 emphasis:{label:{show:true}}
    //             },
    //             data:[
    //                 {name: '北京',value: Math.round(Math.random()*1000)},
    //                 {name: '天津',value: Math.round(Math.random()*1000)},
    //                 {name: '上海',value: Math.round(Math.random()*1000)},
    //                 {name: '重庆',value: Math.round(Math.random()*1000)},
    //                 {name: '河北',value: Math.round(Math.random()*1000)},
    //                 {name: '河南',value: Math.round(Math.random()*1000)},
    //                 {name: '云南',value: Math.round(Math.random()*1000)},
    //                 {name: '辽宁',value: Math.round(Math.random()*1000)},
    //                 {name: '黑龙江',value: Math.round(Math.random()*1000)},
    //                 {name: '湖南',value: Math.round(Math.random()*1000)},
    //                 {name: '安徽',value: Math.round(Math.random()*1000)},
    //                 {name: '山东',value: Math.round(Math.random()*1000)},
    //                 {name: '新疆',value: Math.round(Math.random()*1000)},
    //                 {name: '江苏',value: Math.round(Math.random()*1000)},
    //                 {name: '浙江',value: Math.round(Math.random()*1000)},
    //                 {name: '江西',value: Math.round(Math.random()*1000)},
    //                 {name: '湖北',value: Math.round(Math.random()*1000)},
    //                 {name: '广西',value: Math.round(Math.random()*1000)},
    //                 {name: '甘肃',value: Math.round(Math.random()*1000)},
    //                 {name: '山西',value: Math.round(Math.random()*1000)},
    //                 {name: '内蒙古',value: Math.round(Math.random()*1000)},
    //                 {name: '陕西',value: Math.round(Math.random()*1000)},
    //                 {name: '吉林',value: Math.round(Math.random()*1000)},
    //                 {name: '福建',value: Math.round(Math.random()*1000)},
    //                 {name: '贵州',value: Math.round(Math.random()*1000)},
    //                 {name: '广东',value: Math.round(Math.random()*1000)},
    //                 {name: '青海',value: Math.round(Math.random()*1000)},
    //                 {name: '西藏',value: Math.round(Math.random()*1000)},
    //                 {name: '四川',value: Math.round(Math.random()*1000)},
    //                 {name: '宁夏',value: Math.round(Math.random()*1000)},
    //                 {name: '海南',value: Math.round(Math.random()*1000)},
    //                 {name: '台湾',value: Math.round(Math.random()*1000)},
    //                 {name: '香港',value: Math.round(Math.random()*1000)},
    //                 {name: '澳门',value: Math.round(Math.random()*1000)}
    //             ]
    //         },
    //         {
    //             name: 'iphone4',
    //             type: 'map',
    //             mapType: 'china',
    //             itemStyle:{
    //                 normal:{label:{show:true}},
    //                 emphasis:{label:{show:true}}
    //             },
    //             data:[
    //                 {name: '北京',value: Math.round(Math.random()*1000)},
    //                 {name: '天津',value: Math.round(Math.random()*1000)},
    //                 {name: '上海',value: Math.round(Math.random()*1000)},
    //                 {name: '重庆',value: Math.round(Math.random()*1000)},
    //                 {name: '河北',value: Math.round(Math.random()*1000)},
    //                 {name: '安徽',value: Math.round(Math.random()*1000)},
    //                 {name: '新疆',value: Math.round(Math.random()*1000)},
    //                 {name: '浙江',value: Math.round(Math.random()*1000)},
    //                 {name: '江西',value: Math.round(Math.random()*1000)},
    //                 {name: '山西',value: Math.round(Math.random()*1000)},
    //                 {name: '内蒙古',value: Math.round(Math.random()*1000)},
    //                 {name: '吉林',value: Math.round(Math.random()*1000)},
    //                 {name: '福建',value: Math.round(Math.random()*1000)},
    //                 {name: '广东',value: Math.round(Math.random()*1000)},
    //                 {name: '西藏',value: Math.round(Math.random()*1000)},
    //                 {name: '四川',value: Math.round(Math.random()*1000)},
    //                 {name: '宁夏',value: Math.round(Math.random()*1000)},
    //                 {name: '香港',value: Math.round(Math.random()*1000)},
    //                 {name: '澳门',value: Math.round(Math.random()*1000)}
    //             ]
    //         },
    //         {
    //             name: 'iphone5',
    //             type: 'map',
    //             mapType: 'china',
    //             itemStyle:{
    //                 normal:{label:{show:true}},
    //                 emphasis:{label:{show:true}}
    //             },
    //             data:[
    //                 {name: '北京',value: Math.round(Math.random()*1000)},
    //                 {name: '天津',value: Math.round(Math.random()*1000)},
    //                 {name: '上海',value: Math.round(Math.random()*1000)},
    //                 {name: '广东',value: Math.round(Math.random()*1000)},
    //                 {name: '台湾',value: Math.round(Math.random()*1000)},
    //                 {name: '香港',value: Math.round(Math.random()*1000)},
    //                 {name: '澳门',value: Math.round(Math.random()*1000)}
    //             ]
    //         }
    //     ]
    // };
    // mapChart.setOption(mapoption);
    // $(window).resize(mapChart.resize);

    //var chordChart = echarts.init(document.getElementById("echarts-chord-chart"));
    var chordoption = {
        title : {
            text: '测试数据',
            subtext: 'From d3.js',
            x:'right',
            y:'bottom'
        },
        tooltip : {
            trigger: 'item',
            formatter: function (params) {
                if (params.indicator2) { // is edge
                    return params.value.weight;
                } else {// is node
                    return params.name
                }
            }
        },
        toolbox: {
            show : true,
            feature : {
                restore : {show: true},
                magicType: {show: true, type: ['force', 'chord']},
                saveAsImage : {show: true}
            }
        },
        legend: {
            x: 'left',
            data:['group1','group2', 'group3', 'group4']
        },
        series : [
            {
                type:'chord',
                sort : 'ascending',
                sortSub : 'descending',
                showScale : true,
                showScaleText : true,
                data : [
                    {name : 'group1'},
                    {name : 'group2'},
                    {name : 'group3'},
                    {name : 'group4'}
                ],
                itemStyle : {
                    normal : {
                        label : {
                            show : false
                        }
                    }
                },
                matrix : [
                    [11975,  5871, 8916, 2868],
                    [ 1951, 10048, 2060, 6171],
                    [ 8010, 16145, 8090, 8045],
                    [ 1013,   990,  940, 6907]
                ]
            }
        ]
    };

    //chordChart.setOption(chordoption);
   // $(window).resize(chordChart.resize);

    // var forceChart = echarts.init(document.getElementById("echarts-force-chart"));
    // var forceoption ={
    //     title : {
    //         text: '1000019：1000020',
    //         subtext: '数据来自人立方',
    //         x:'right',
    //         y:'bottom'
    //     },
    //     tooltip : {
    //         trigger: 'item',
    //         formatter: '{a} : {b}'
    //     },
    //     toolbox: {
    //         show : true,
    //         feature : {
    //             restore : {show: true},
    //             magicType: {show: true, type: ['force', 'chord']},
    //             saveAsImage : {show: true}
    //         }
    //     },
    //     legend: {
    //         x: 'left',
    //         data:['1000017','1000018']
    //     },
    //     series : [
    //         {
    //             type:'force',
    //             name : "1000016",
    //             ribbonType: false,
    //             categories : [
    //                 {
    //                     name: '人物'
    //                 },
    //                 {
    //                     name: '家人'
    //                 },
    //                 {
    //                     name:'朋友'
    //                 }
    //             ],
    //             itemStyle: {
    //                 normal: {
    //                     label: {
    //                         show: true,
    //                         textStyle: {
    //                             color: '#333'
    //                         }
    //                     },
    //                     nodeStyle : {
    //                         brushType : 'both',
    //                         borderColor : 'rgba(255,215,0,0.4)',
    //                         borderWidth : 1
    //                     },
    //                     linkStyle: {
    //                         type: 'curve'
    //                     }
    //                 },
    //                 emphasis: {
    //                     label: {
    //                         show: false
    //                         // textStyle: null      // 默认使用全局文本样式，详见TEXTSTYLE
    //                     },
    //                     nodeStyle : {
    //                         //r: 30
    //                     },
    //                     linkStyle : {}
    //                 }
    //             },
    //             useWorker: false,
    //             minRadius : 15,
    //             maxRadius : 25,
    //             gravity: 1.1,
    //             scaling: 1.1,
    //             roam: 'move',
    //             nodes:[
    //                 {category:0, name: '乔布斯', value : 10},
    //                 {category:1, name: '丽萨-乔布斯',value : 2},
    //                 {category:1, name: '保罗-乔布斯',value : 3},
    //                 {category:1, name: '克拉拉-乔布斯',value : 3},
    //                 {category:1, name: '劳伦-鲍威尔',value : 7},
    //                 {category:2, name: '史蒂夫-沃兹尼艾克',value : 5},
    //                 {category:2, name: '奥巴马',value : 8},
    //                 {category:2, name: '比尔-盖茨',value : 9},
    //                 {category:2, name: '乔纳森-艾夫',value : 4},
    //                 {category:2, name: '蒂姆-库克',value : 4},
    //                 {category:2, name: '龙-韦恩',value : 1},
    //             ],
    //             links : [
    //                 {source : '丽萨-乔布斯', target : '乔布斯', weight : 1, name: '女儿'},
    //                 {source : '保罗-乔布斯', target : '乔布斯', weight : 2, name: '父亲'},
    //                 {source : '克拉拉-乔布斯', target : '乔布斯', weight : 1, name: '母亲'},
    //                 {source : '劳伦-鲍威尔', target : '乔布斯', weight : 2},
    //                 {source : '史蒂夫-沃兹尼艾克', target : '乔布斯', weight : 3, name: '合伙人'},
    //                 {source : '奥巴马', target : '乔布斯', weight : 1},
    //                 {source : '比尔-盖茨', target : '乔布斯', weight : 6, name: '竞争对手'},
    //                 {source : '乔纳森-艾夫', target : '乔布斯', weight : 1, name: '爱将'},
    //                 {source : '蒂姆-库克', target : '乔布斯', weight : 1},
    //                 {source : '龙-韦恩', target : '乔布斯', weight : 1},
    //                 {source : '克拉拉-乔布斯', target : '保罗-乔布斯', weight : 1},
    //                 {source : '奥巴马', target : '保罗-乔布斯', weight : 1},
    //                 {source : '奥巴马', target : '克拉拉-乔布斯', weight : 1},
    //                 {source : '奥巴马', target : '劳伦-鲍威尔', weight : 1},
    //                 {source : '奥巴马', target : '史蒂夫-沃兹尼艾克', weight : 1},
    //                 {source : '比尔-盖茨', target : '奥巴马', weight : 6},
    //                 {source : '比尔-盖茨', target : '克拉拉-乔布斯', weight : 1},
    //                 {source : '蒂姆-库克', target : '奥巴马', weight : 1}
    //             ]
    //         }
    //     ]
    // };
    // forceChart.setOption(forceoption);
    // $(window).resize(forceChart.resize);
    //信息发送图开始----------------------------------------------------------------------
    var messageChart = echarts.init(document.getElementById("echarts-message-chart"));
    var chinaGeoCoordMap = {
        '黑龙江': [127.9688, 45.368],
        '内蒙古': [110.3467, 41.4899],
        "吉林": [125.8154, 44.2584],
        '北京市': [116.4551, 40.2539],
        "辽宁": [123.1238, 42.1216],
        "河北": [114.4995, 38.1006],
        "天津": [117.4219, 39.4189],
        "山西": [112.3352, 37.9413],
        "陕西": [109.1162, 34.2004],
        "甘肃": [103.5901, 36.3043],
        "宁夏": [106.3586, 38.1775],
        "青海": [101.4038, 36.8207],
        "新疆": [87.9236, 43.5883],
        "西藏": [91.11, 29.97],
        "四川": [103.9526, 30.7617],
        "重庆": [108.384366, 30.439702],
        "山东": [117.1582, 36.8701],
        "河南": [113.4668, 34.6234],
        "江苏": [118.8062, 31.9208],
        "安徽": [117.29, 32.0581],
        "湖北": [114.3896, 30.6628],
        "浙江": [119.5313, 29.8773],
        "福建": [119.4543, 25.9222],
        "江西": [116.0046, 28.6633],
        "湖南": [113.0823, 28.2568],
        "贵州": [106.6992, 26.7682],
        "云南": [102.9199, 25.4663],
        "广东": [113.12244, 23.009505],
        "广西": [108.479, 23.1152],
        "海南": [110.3893, 19.8516],
        '上海': [121.4648, 31.2891]
    };
    var chinaDatas = [
        [{
            name: '黑龙江',
            value: 0
        }],	[{
            name: '内蒙古',
            value: 0
        }],	[{
            name: '吉林',
            value: 0
        }],	[{
            name: '辽宁',
            value: 0
        }],	[{
            name: '河北',
            value: 0
        }],	[{
            name: '天津',
            value: 0
        }],	[{
            name: '山西',
            value: 0
        }],	[{
            name: '陕西',
            value: 0
        }],	[{
            name: '甘肃',
            value: 0
        }],	[{
            name: '宁夏',
            value: 0
        }],	[{
            name: '青海',
            value: 0
        }],	[{
            name: '新疆',
            value: 0
        }],[{
            name: '西藏',
            value: 0
        }],	[{
            name: '四川',
            value: 0
        }],	[{
            name: '重庆',
            value: 0
        }],	[{
            name: '山东',
            value: 0
        }],	[{
            name: '河南',
            value: 0
        }],	[{
            name: '江苏',
            value: 0
        }],	[{
            name: '安徽',
            value: 0
        }],	[{
            name: '湖北',
            value: 0
        }],	[{
            name: '浙江',
            value: 0
        }],	[{
            name: '福建',
            value: 0
        }],	[{
            name: '江西',
            value: 0
        }],	[{
            name: '湖南',
            value: 0
        }],	[{
            name: '贵州',
            value: 0
        }],[{
            name: '广西',
            value: 0
        }],	[{
            name: '海南',
            value: 0
        }],	[{
            name: '上海',
            value: 1
        }]
    ];

    var convertData = function(data) {
        var res = [];
        for(var i = 0; i < data.length; i++) {
            var dataItem = data[i];
            var fromCoord = chinaGeoCoordMap[dataItem[0].name];
            var toCoord = [116.4551,40.2539];
            if(fromCoord && toCoord) {
                res.push([{
                    coord: fromCoord,
                    value: dataItem[0].value
                }, {
                    coord: toCoord,
                }]);
            }
        }
        return res;
    };
    var series = [];
    [['北京市', chinaDatas]].forEach(function(item, i) {
        console.log(item)
        series.push({
                type: 'lines',
                zlevel: 2,
                effect: {
                    show: true,
                    period: 4, //箭头指向速度，值越小速度越快
                    trailLength: 0.02, //特效尾迹长度[0,1]值越大，尾迹越长重
                    symbol: 'arrow', //箭头图标
                    symbolSize: 5, //图标大小
                },
                lineStyle: {
                    normal: {
                        width: 1, //尾迹线条宽度
                        opacity: 1, //尾迹线条透明度
                        curveness: .3 //尾迹线条曲直度
                    }
                },
                data: convertData(item[1])
            }, {
                type: 'effectScatter',
                coordinateSystem: 'geo',
                zlevel: 2,
                rippleEffect: { //涟漪特效
                    period: 4, //动画时间，值越小速度越快
                    brushType: 'stroke', //波纹绘制方式 stroke, fill
                    scale: 4 //波纹圆环最大限制，值越大波纹越大
                },
                label: {
                    normal: {
                        show: true,
                        position: 'right', //显示位置
                        offset: [5, 0], //偏移设置
                        formatter: function(params){//圆环显示文字
                            return params.data.name;
                        },
                        fontSize: 13
                    },
                    emphasis: {
                        show: true
                    }
                },
                symbol: 'circle',
                symbolSize: function(val) {
                    return 5+ val[2] * 5; //圆环大小
                },
                itemStyle: {
                    normal: {
                        show: false,
                        color: '#f00'
                    }
                },
                data: item[1].map(function(dataItem) {
                    return {
                        name: dataItem[0].name,
                        value: chinaGeoCoordMap[dataItem[0].name].concat([dataItem[0].value])
                    };
                }),
            },
            //被攻击点
            {
                type: 'scatter',
                coordinateSystem: 'geo',
                zlevel: 2,
                rippleEffect: {
                    period: 4,
                    brushType: 'stroke',
                    scale: 4
                },
                label: {
                    normal: {
                        show: true,
                        position: 'right',
                        //offset:[5, 0],
                        color: '#0f0',
                        formatter: '{b}',
                        textStyle: {
                            color: "#0f0"
                        }
                    },
                    emphasis: {
                        show: true,
                        color: "#f60"
                    }
                },
                symbol: 'pin',
                symbolSize: 50,
                data: [{
                    name: item[0],
                    value: chinaGeoCoordMap[item[0]].concat([10]),
                }],
            }
        );
    });

    var messageOption = {
        tooltip: {
            trigger: 'item',
            backgroundColor: 'rgba(166, 200, 76, 0.82)',
            borderColor: '#FFFFCC',
            showDelay: 0,
            hideDelay: 0,
            enterable: true,
            transitionDuration: 0,
            extraCssText: 'z-index:100',
            formatter: function(params, ticket, callback) {
                //根据业务自己拓展要显示的内容
                var res = "";
                var name = params.name;
                var value = params.value[params.seriesIndex + 1];
                res = "<span style='color:#fff;'>" + name + "</span><br/>数据：" + value;
                return res;
            }
        },
        backgroundColor:"#013954",
        visualMap: { //图例值控制
            min: 0,
            max: 1,
            calculable: true,
            show: true,
            color: ['#f44336', '#fc9700', '#ffde00', '#ffde00', '#00eaff'],
            textStyle: {
                color: '#fff'
            }
        },
        geo: {
            map: 'china',
            zoom: 1.2,
            label: {
                emphasis: {
                    show: false
                }
            },
            roam: true, //是否允许缩放
            itemStyle: {
                normal: {
                    color: 'rgba(51, 69, 89, .5)', //地图背景色
                    borderColor: '#516a89', //省市边界线00fcff 516a89
                    borderWidth: 1
                },
                emphasis: {
                    color: 'rgba(37, 43, 61, .5)' //悬浮背景
                }
            }
        },
        series: series
    };
    messageChart.setOption(messageOption);
    $(window).resize(messageChart.resize);
    //信息发送图结束-------------------------------------------------------------



    //折线图开始------------------------------------------------------------
    var XName= ["周一","周二","周三","周四","周五","周六","周日"]
    var data1 = [
        [123,154, 234, 321,120,390, 634],
        [63,194, 234, 321,278,110, 534],
        [53,254, 234, 321,118,240, 434],
        [23,354, 334, 221,178,190, 234],
    ]
    var Line = ["云篆山水路线","昕博朗学校路线","新华小学路线","云锦五路路线"];
    var img = [
        'image://data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAFAAAABRCAYAAABFTSEIAAAACXBIWXMAAAsSAAALEgHS3X78AAAEp0lEQVR42u3cz4sjRRTA8W9Vd3Vn8mMmjj9WQWSRZQ+CsH+B7MnDIgiCd0E8CYJ/gOAIelo8ehUP/gF6WLw5/gMueFP2sIcF0dHd2Z1kknR11fOQZJJJMtlZd03H7HtQpNOTnpn+8Lrm1etmjIig8e/DKoECKqACKqCGAiqgAiqghgIqoAIqoIYCKqACKqCGAiqgAiqghgIqoAJudKTr+osZMNPvBUQBHwHsPF9fB9R0DeHMOQ6T6WOrhEzXBM4swDOL0M6CrArRVoq3t2dGUIb9fTvatg8ZZup1PDBgzPmy98mey6qfzjLz2WaWjEUZKEvGyi9nWyneMOvGIyFQo2Sbg4MUSChpU9IeTTUpJdsEajPZOJeJG5uBZj7rLLduWS5dGm6XNLEELOFUFj54ACJCaychkpDSASK3bwsXL0YgVpWJKwM0iy9Zy8HdGru7jvt3Pbu7w0wES7drTwAbjTHMGCsQcIAnYTC1/wRx0wEnl27JNgZI8HQ6Kc1mQq83RNzaMjPzXqDbjTQaJRFLxIyyMSxAXEkWrhrQzAAmo5HOjCQf7jflILxOkohL+aUPgV4vEGNJo+E5PAy02+UIMEwBxo0CPDP7Dg5SnEtpt1PA0e87XO25FOoh8IYIH2Y5b45RzGAQBiIltZoHxqMcjbksXAVgdc2EQMYzzzdotyeZWKuleULXJtwT4SODfC2QCWR+IF9KnjuX1Xbo99Op7LVE8iXlz0YBTk5SyLEEjo5OLuccEoFUvHfO+reuUPx4zftXAIcx1hdcF+/TvFab4A0Bs0VwqyhpVnkJT89/Q4DDQ0e77YCMwIUsFMeFZD856699URRvX4nxE4A/jbnxXp7v4Zw3ReGNSDHI8wFQjIafuoyn58L/fB6sth/Ybg9fez2TRC6QZcZYvgHsazF+MP7YCyLXcM7gvSXLDGBqYDg+NhwdmSpPoTrAkub0W+f4FSB1fDucIunMHSLpO8WAH0rSy8u+19MBCHB4OHzd2pI+CEUhpigEiN+l6WcdY252jLn5s7Wf472ImPcN8pUl/tEHoV4XWq1Ke4KrLmPsTA3oODpytFoOyJKSyzHyMSIxteWngMW5cSEdDJQUhTdZVgxOz3/+jFJm4+bA2e5JpNU6WZ4Fw99JwnWMKccwpeddP+B7GZTNUPKqybJy0O+Hs1YfMz9swwvpB8fbGDG0GuGkkK7V0hxSmZQpABI8l2z0v3sJf50qpAMJCd2qCulql3LD1lRGQjm7lEsDz0rkxTQOfiPPxUBcuJTbbhss/Y1eyi3NwsmKInmkZsKk5gtPUzNhvp11507CSy/X6XYStpvFudpZw1ZWIOF4Cq6SdtbKbioJyAhRTu3u9yMJXerN+ugvaQQsjcZ8Q3VnZwxlSDhe1lB9GjrSw5b+1avT8+Jw+979nNaOI6U3KpTrWAosxVQmygK4ld8X0ZtK/7eViExD7O1NQPb3T7fsl4/4sBpwYzPwjFbTo95Yl9l9Vd1YN1X/147HebSjary1AHyc5qc+XLQEQx9ve8Kg6xr6hKoCKqACKqCGAiqgAiqghgIqoAIqoIYCKqACKqCGAiqgAiqghgIq4JrHP8fEWV8FMTmOAAAAAElFTkSuQmCC',
        'image://data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAE8AAABPCAYAAACqNJiGAAAACXBIWXMAAAsSAAALEgHS3X78AAAGS0lEQVR42u2cz4skSRXHPy8iMrOrq7qnp3dqloEeD0PvHrbxB/TJkwt6EGVBwRHUf0BPXj146JPgosJe/PEX6NoHYUUE8bCC11ZQtw+DLMq2DtPlbM9MVXVVZkbE85DVXdU97e6yi1U9TXwhyaIq4lXmh29ERrxXlKgqSR9OJiFI8BK8BC/BS0rwErwEL8FLSvASvAQvwUvwkhK8BC/BS/CSErwEL8FL8JISvI8udxkvShA5/55y+QrMchmK3hfBej9dBpgLhXcBNIGd9+ix03C7JBAXBm8GnEzBvDV53bvAid3JhW7pDGBdJMC5wzvnNoG7U2B7fWF7G/aPhJdmWu0DL11X9vZge0WnIHd11onzhrgoeDJ1Wk/gRYEjgYHA88LBUNiY6XQAbLQVHih0FK4r3JtAPHWizhueWYzrZsDtdw28Y6BtKJfbVHWbDSzvxg5la413Y4cNLFXdZtxepV4q4B3T9OtJE2fnQz94ngnnzYCTqeO6DbT7Dw1uyZBlHTreM3QBqacgNFPa3jJwjhg85fExt56LMIzQizMOnOscOO9F8tPgyv4ymVi6WExdMbJgbYZ1GSU51mVYmzGyYOqK9ViTiaXsL0PbNHFOHIhcuWF7drhCM8cNhLK/zBCLW7fQcqegqphjNMfRnKuYnwKl5XDrliETgIPJnDmNP6/hO+cdxonrEOgYCipGtcOWjqF3mJal9A6Lxahg7QZB1nB6RKX/pMg8w5FgnUCoKTIPHQNHOnHfU+vAKzJsd+SM6x48NpAb1jKDwVLmjljfJONFRL5CaX8A5tcQ7yHmAS2TIVVGmTsMlrWs6f/gsTnnPrmC8IA3e8L+UbMcydfbPBoaBlhELctqCTJAwwHoZ4BPA6/hydH4I8rwDSqzRaE3ELUMsDwaGvL1NjzfxH2zd7XmvDPzz8vQLH6HgpYekxnEGcZYZAJRnCPG7+L44nf4wgG5dcBfQL4M+hDlVtPeGUxm0NLDsFlUv/zR9suXP6vy94HQdkKx6pHjDBCWW4IPn0D5JF7/+Cn5WPx++OrPWpK/8Pnw8cFr/O7rv4p/fh1nKjL5D84JYSSIF1iuuf9EGHph86rm83bfusAJKyCFgBeCCvBNNB5/y3z2lRb5C80FSudLsv0KRIEolLFpL4XAygf8nmcd3t0tPTeeLQDHwBiAv2H0c2RmNJbqyWzTUuo+mVGi/B5YYzzpd6K8aP/P77lCi2TY7ExvTkeKlorWCkbBRdD4bfP6G//i0S8GjP/Uo/+bn8gf3gCNID8FbqL1pN+oiRVCdSbunLSYTHJYUkLfYzqOlo1UMYJuEilBfgjht1+LP34VcYJ6JWjEmYDYnxO1RiXSMpEQlNhXqqJexG383513dp/ZbTIivq3cuBaJdUR9JEog+vsQIvBLkC2c1kStMeZ7GPsqUe6g9S3iOBAlNP3qyI1rEd+eZFq6c01PzSUxME1D3RX23jZs3zQ8bK+y0oZR7bGFYzzKsLnDeIcYg9QGMoFaUXsLWCaaf+N9j6VWTSg9rczRH8JzwyfsHUa278STHN884M1zzmsyH9sryn5HWW2N6fvINQnEQSBkniLW5FKhsUU0N1G/SZCKyD/I5K/kHBIyTxwErkmg7yOrrTH7nSYuWzrP7dk8ncdZ990RDrAUWLq5AbX01WKwjKxh2U+XHMdOaYVIJLAiASTQqyIlgQ0Ce2/rrOvmNWzNfCx3eiMT992JcF0ZDxoANQ6fC6HwBF9TmIog06MwFcHXhMLjc6GkoCQwHjRxtu/EWddd1XxekzbaBbinbN6OjAeRLDsm9KEeelZXalZCjffTYyXUrK7U1ENP6IMxY8aDyObtCPe0ibdz9Z62F7rv7q6y21U4ijy+3WSEi+Mh3banHkI5dmheUC15qiXPuCyoh0K37SmOh2Tjsul3FNntNvEWUElbZPXs6SLQadVscMEWq6OnVbQLij/zBreQYXt2/ttRmHHhYW9SkxgF9g4jHMbmPArQm3w+cRu7JzWLhdVuL0PRm7NOPMk4n9fJnnXnqWzxwn41oKoLPVDkwmMHg2Im5wvbLPra5TL9u8UHSWBepl9LSfprkGdqnZfgJSV4CV6Cl+AleEkJXoKX4CV4SQlegpfgJXgJXlKCl+AleAleUoKX4CV4V0//BfBm5Ekg9qBkAAAAAElFTkSuQmCC',
        'image://data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAE8AAABPCAYAAACqNJiGAAAACXBIWXMAAAsSAAALEgHS3X78AAAGZklEQVR42u2cTYgkSRXHfy8iP6q7qr92e+wunIPIIGyN60XRk+xFT7IHD3vypiDexJuHhZ5G2IOgZw96Fd3Z06J48SJ4VWGh66CLIDvSPXa7PVVdn5kR8TxUdpnVM8Muylb1FPEgqazKiMjKH/8XH+8FKapKtP/NTEQQ4UV4EV6EFy3Ci/AivAgvWoQX4UV4EV6EFy3Ci/AivAgvWoQX4UV4EV60CO//t+Q2/ikR5OZvqmiE93Fg6UeXuQ0wZZU7BuZArv/C8dOKe8qOqtKyeogrgyeCoDeAdarz7jMgdipI3RqsIxRZHUCzCmgL4E6QCprhsjqojk7tvH6tU9U7nrUzb3PdlSeC8KB60A5CF6GNsIdwhrCFcPlI4G6t1iPYu6tcoRyiXKKconTQuRIfoMtWoFmJq9bBgWGKMT2f29Rt2+Cb5HetafmWbfpd0/It8rvWBt+0qds2PZ8zrRTYnauWawWuJbwFV62DA0OOpSDHT2woRZBeGgZD762dhsHQI700lCL4yaxcjp3XvQZYc+G1c9u5u94AZw/8pu/bkl0MFovHEDAkCMVQyJqKQzEELAGP5wnBbvvUP7YjIABh7sJLdF+zdHcFaCO8hNgDv6kWS4alJGEwTIGUcpxRjDOcnX2W4wxIGQxTShIyrFqsPfCbvFT1mbU54rLUt9xJ8gkClfoeYby1BZMnCd4mZCYhb1rKSUJibG4RFXkVQb1w6cvJP8ibjjAUfJAw9CXZrsNhOETpIpw8b4r9ArvtgstezgYIpo8T8gPLJgkDUsw4NUl2J8HvA18FvoPh63hURAOKn5rcUY4dYaOkRckIx/SxJz9w5AT2CMt03eUMGNeP0UU47QpbiG2+3MRjGGGxWMyGTUs3QHkE8kXgPfVlplYyxfxURb6V+eK+sdk+Fsto1j/a5stNtqp2uzdWLC86vKf6n04HLhFNjUP7s8HBjG3DYNWIJZCo8KYib/7gC/IVAgnoe8A3gX8nom3M2BIwaN9oahyXCJ3ORwYXXvzAwNn7QvOehLFxZJIiCMmGBO9ewfIlVf746k4RfvTl8MvMcPha25/9vGu++5sPsl9LooX45IIkmfWdKhLGpqSJcPa+wL01XZ6dPKyUUH/ALUhGQokg5l/A9zAy+vYrvJ4ZDgEyw+E3PqOvYxBMJlhm5ZORwFatrXs37rNO8O6/Me+JbHDNxYsTRMonBL5GYDz19OtXiyBXBHJc8XvV6S5MFmovtFe7z9oFBjhEVXoFfAgNFKdKiuJRhCCi4Yd/yt49Hcmvho4/X0zkt7/4W/KuiG4AP0PlU6RVvQYKH6LSKzhcfmTlE5+q3Ag9zZZU21jKi4St/QSZTYqT1HzeSDIl+J8Av1ORd/AItoLq1EmWlVOZlIy1JN0oUEquLhzpvqOPn682lhSq+sSVt/AAHZQ2yh5Ke3+23DIEcvUBTnE+AG8D9wUtRbUU1bck6I8xfFaLok3Ak6ufL9fa+2HWXhVlWWKkeTmjrQAPat+vUJu6TbVCcNbR2JQwHJ0XmblsePlAs/wdwtSgCAnf12DbhLDprD6hCI7mpmOCN4nPZKiZL5M++Y376Rq47fNc13za52LIfG5LJiSUgwTTshisKaZ7ibCDsmOMnkw8St7wBDxh4ElbjgbOTn2qgSL8006X7bLLHTBk0XXDjp36nh3ROw80cGirBEoYliHxF4X3fy8a+V8mLhSkoYDh7Lq2Sho4eufB9+wo7NjpgsvKGg0Yz43nXa9xHcbs+A2CEAb9wJYxTLaFtIahRGn0lasQTGvbiKj1fTsgISysaZec01juVOUax0PgFCUnkBCCsSNxClnpkO2SXSoVVscuJbJdkpVOnKLKZA7uFOXhjfbXbZ43V8MRyn2UE5S9CkCT4Es7ZPOOM1kQe+VyO/YJfRx9nL1yucmCsHnH+dIOw46dzhV3UrVXpSSXmcdYTQKonnKsJ4FOETrA2TM0NIvZQfsZyZ8VpSBXkrddSHZfpx/f4L/52teAv9YAfg7lD7UB5yHM1bbC5PdKtluooiJINR9TQCslzgCcI+zVYJzXonRd4O3bsWtAVv2Chqe2XFzb8bHAEXAMR0f6rIFn1ftV5Da93eLjBDBv024pia8GeZFCUhFetAgvwovwIrwIL1qEF+FFeBFetAgvwovwIrwIL1qEF+FFeBFetAgvwovw1tD+A2QKHlM6/+MtAAAAAElFTkSuQmCC',
        'image://data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAE8AAABPCAYAAACqNJiGAAAACXBIWXMAAAsSAAALEgHS3X78AAAHaUlEQVR42u3cv29jWRUH8O+5P96zX5x4Mk4yjCW0S5QqZil2aIEUUG5BEQr4B2joKBclrhAF1HR0gNYVK6BapDSIyhSLnAKNxBSrLJOJd+L413vv3nsOhfNjMhmx4sfaSXSP5ESOrt/1++jcn+8qJCKI8d+FigQRL+JFvIgXI+JFvIgX8WJEvIgX8SJexIsR8SJexIt4MSJexIt4ES9GxPvfw9zGL0Ugev1vgtv3gJluw0NvApH8R+VvB+ZC8a6jCdpo096/Kd8GsIc9mfEtHnGBzXYG18b+OVgb2+gRABzgBQE7r5Q9wA7WZfuScB9tAIJ9AYiwIECz2GzbpyuwFm1ilQBgA63X+rwdAEeyCeAAkB30ziH3gXPARWTh3EfbWbaBgH0CerSOFnWxqjYAVUeqnqGpB58M9AquXoNPBvoZmrqOVG0AqotVtY4WAT0C9qkNkNz/Pu9iFN0/v/EWHQIqQZ9UqCeauaLJcWqWilM/WQYANhg9RCaFH6eMRNjYiUdfSjRkG2CgJ0BLZhkIzLMJzxHvzXAZnqn+p4mqVauZ1srQkvWToQqaisumGySVbJm1jJ0p82I09Z4bj0ue4G1eJOBc8drnfdw6WrQBqAxQyrtseuqcXSOVn5XarCilR6QUJTSFoyqssJQSasL+jLmykgR3Ilx9YC0bO5kAfAzwC/TkEC3Zw77MC28uA8bFIDEbVXfRxUeUICXlV7KCnE7XSraoatJsFKrKaa8ZOYEsseQiMJLCBKvHnECRWpuGIkCnHllizsbLKGgHuwIcvlLfFw84lwFDzn920CPgkKpoUgVGjYwt7bB05VCbwdhbu1QznBeJKJeI0kkKvAsy74J4k/MisUs1Mxh7Ww61scPSjYwtKzCqiiYBhzS7vkDuV59Hl6NrF6uqjlRNnqcme1TTFcC4cWmD8lYTrTNQBeSbAH4kKnzHQgsLmKGCFngv7DUbZ5cSlwN+8nwUskeFH6DgJ3jJV33fPcm8q6lui6qHTTJoUOVhsmRwqvJRoQ15ratWS8kjVvISwDcAfCxOJYWjhAW/gPAPAnNLWb1myOt8VGiDUzW7ToOqh006uDE/vON4Nxb524DBgKC9n5yR0kSqJK91EbSqsNYgI+zfh1bvV6W1rRMygHwM4LtKcx8+PC7Ja02kJmekoL03GBC2P39z4Q42W6LzqTEBUE+f9vVgqaHrad94W7MV5S1rlQjkHQJ9PQT+ncVXvpzxO78GqAbwP4fqL99nnLxMrSmdSEkipQpc5myccSM3KBq+Pu6Hra1GAMC4XP9+sTc3t2bb6cyWYdgCmo8BPGxgGQCRJYInQI4F8kMiTRV5+70ZHACoL2Wy/R6RphJMhEAET0SWljG7TvPx7LrX6rlPy7Pd3dZlFpSuXAL6GAKYYHKRn6ei6NvGBgHx8HryhjNtQkosH4nQV3H+uVmhPgIH/aZ67gneVTJsoSGDs0GJz4Daci5VsSIwIoUXC2ER4dz0PhRM/yBwf2WMfztO/vyhCKoE/BLMIjBSFSu15VzwGXDSP8EWGvKm+u70JJku53nAAYANAA8bSTk+sYYHSoL2LCKsErPlmQpA/Vzk5PfDyp9+AhcIVguXgWHtsYL6jVHsnMyQ1SCVwFbW1p0/BHCMq42sV+u9s5n36kx/tpV0JB51ebDG7OvCQYSdlEFAnwLCAD4goq+ReEeE71HgP2ptfkYsmyLhcYAOTsoQRNjXhR+sMXvUZRtHsoOevKneO9/ntc9/d7uAR19yV2YhSFJZtmE1q3rPeEGgfzC5D1JSPybhUin6FZH/lgZ+KmAP4NSx+NWs6ivLNoQgSe7KzKMv3e71eu7ZCmO2o3IAqA1AVYJPEymS3Cy5CgamGGljlNeOEh2I1wzUIw/+ewojUzixooOVMng2Ia0Fn6PuK35sS0rLXJviGOAdgOe5szKXzKNre8I9mXaPZFObAsZPyhfHnKHubc24JNNOc+GY/fOE8besogrNXIJDqblwSaadrRmXoe7LF8cM4yeb2hTT7vUmS/cr827u512scSswSrypWUUhPyt5okjVVyqkUF4aMBIZnOWSsXBlJVFeBNB+msPzzTXt/Pbz5tbn0St9X6cDDNGUAQrOn3p2lOYlTzFxpdcr1k0xclOYV14jp1esm7jSlzyF10uT/OkMboimdDpXfR3dvz7vZvZ1Oj3a3QW6WFVVNClBnwwaRGGYgNN0YMsJAFhPlUysgioK0cvlxRb8FEfyBC+507mYGM9/G37OD4AubmxfDndbArTkCV7yNsADFDxBj9/Sy7mzw7MMhc9QeGvykbPDs7f0cj5BjwcoeBu4bKqHC4JbQOa9noHnWYge7WL2vHbnfJrbxdFlmSdoymySPXt+2wGwe62Pmz/cAvHedMRi/xKrg5uL+xnWZVm5voJZzE0s/KzKTcTZu3a7TdibjTB7e3vy+nBwG86r0G367xafd+DnthzwuZV4dy3i4caIF/EiXsSLEfEiXsSLeDEiXsSLeBEv4sWIeBEv4kW8GBEv4kW8iBcj4v0f4l+bPQ5YnMn04QAAAABJRU5ErkJggg==',
    ];
    var color =['#00f8ff','#00f15a','#0696f9','#dcf776'];


    var datas = [];
    Line.map((item,index)=>{
        datas.push(
            {
                symbolSize: 150,
                symbol: img[index],
                name: item,
                type: "line",
                yAxisIndex: 1,
                data: data1[index] ,
                itemStyle: {
                    normal: {
                        borderWidth: 5,
                        color: color[index],
                    }
                }
            }
        )
    })

    echarts.init(document.getElementById('echarts-line-chart')).setOption({
        backgroundColor: '#0e2147',
        grid: {
            left: '5%',
            top: '5%',
            bottom: '5%',
            right: '5%',
        },
        legend: {
            type: "scroll",
            data:Line,
            itemWidth:18,
            itemHeight:12,
            textStyle: {
                color:"#00ffff",
                fontSize:14
            },
        },
        yAxis: [
            {
                type: 'value',
                position: 'right',
                splitLine: {
                    show: false
                }
                ,
                axisLine: {
                    show: false
                },
                axisTick: {
                    show: false
                },
                axisLabel: {
                    show: false
                }
            },
            {
                type: 'value',
                position: 'left',
                nameTextStyle: {
                    color: '#00FFFF'
                },
                splitLine: {
                    lineStyle: {
                        type: 'dashed',
                        color: 'rgba(135,140,147,0.8)'
                    }
                },
                axisLine: {
                    show: false
                },
                axisTick: {
                    show: false
                },
                axisLabel: {
                    formatter: '{value}',
                    color: '#fff',
                    fontSize: 14
                }
            },
        ],
        xAxis: [
            {
                type: 'category',
                axisTick: {
                    show: false
                },
                axisLine: {
                    show: false,
                    lineStyle: {
                        color: '#6A989E',
                    }
                },
                axisLabel: {
                    inside: false,
                    textStyle: {
                        color: '#fff',// x轴颜色
                        fontWeight: 'normal',
                        fontSize: '14',
                        lineHeight: 22
                    }

                },
                data: XName,
            },
            {
                type: 'category',
                axisLine: {
                    show: false
                },
                axisTick: {
                    show: false
                },
                axisLabel: {
                    show: false
                },
                splitArea: {
                    show: false
                },
                splitLine: {
                    show: false
                },
                //-----
                data: ['1月', '2月', '3月', '4月', '5月', '6月'],
            },
        ],
        series: datas,
    });
//折线图结束-----------------------------------------------
    var gaugeChart = echarts.init(document.getElementById("echarts-gauge-chart"));
    var gaugeoption = {
        tooltip : {
            formatter: "{a} <br/>{c} {b}"
        },
        toolbox: {
            show : true,
            feature : {
                mark : {show: true},
                restore : {show: true},
                saveAsImage : {show: true}
            }
        },
        series : [
            {
                name:'速度',
                type:'gauge',
                min:0,
                max:220,
                splitNumber:11,
                axisLine: {            // 坐标轴线
                    lineStyle: {       // 属性lineStyle控制线条样式
                        width: 10
                    }
                },
                axisTick: {            // 坐标轴小标记
                    length :15,        // 属性length控制线长
                    lineStyle: {       // 属性lineStyle控制线条样式
                        color: 'auto'
                    }
                },
                splitLine: {           // 分隔线
                    length :20,         // 属性length控制线长
                    lineStyle: {       // 属性lineStyle（详见lineStyle）控制线条样式
                        color: 'auto'
                    }
                },
                title : {
                    textStyle: {       // 其余属性默认使用全局文本样式，详见TEXTSTYLE
                        fontWeight: 'bolder',
                        fontSize: 20,
                        fontStyle: 'italic'
                    }
                },
                detail : {
                    textStyle: {       // 其余属性默认使用全局文本样式，详见TEXTSTYLE
                        fontWeight: 'bolder'
                    }
                },
                data:[{value: 40, name: 'km/h'}]
            },
            {
                name:'转速',
                type:'gauge',
                center : ['25%', '55%'],    // 默认全局居中
                radius : '50%',
                min:0,
                max:7,
                endAngle:45,
                splitNumber:7,
                axisLine: {            // 坐标轴线
                    lineStyle: {       // 属性lineStyle控制线条样式
                        width: 8
                    }
                },
                axisTick: {            // 坐标轴小标记
                    length :12,        // 属性length控制线长
                    lineStyle: {       // 属性lineStyle控制线条样式
                        color: 'auto'
                    }
                },
                splitLine: {           // 分隔线
                    length :20,         // 属性length控制线长
                    lineStyle: {       // 属性lineStyle（详见lineStyle）控制线条样式
                        color: 'auto'
                    }
                },
                pointer: {
                    width:5
                },
                title : {
                    offsetCenter: [0, '-30%'],       // x, y，单位px
                },
                detail : {
                    textStyle: {       // 其余属性默认使用全局文本样式，详见TEXTSTYLE
                        fontWeight: 'bolder'
                    }
                },
                data:[{value: 1.5, name: 'x1000 r/min'}]
            },
            {
                name:'油表',
                type:'gauge',
                center : ['75%', '50%'],    // 默认全局居中
                radius : '50%',
                min:0,
                max:2,
                startAngle:135,
                endAngle:45,
                splitNumber:2,
                axisLine: {            // 坐标轴线
                    lineStyle: {       // 属性lineStyle控制线条样式
                        color: [[0.2, '#ff4500'],[0.8, '#48b'],[1, '#228b22']],
                        width: 8
                    }
                },
                axisTick: {            // 坐标轴小标记
                    splitNumber:5,
                    length :10,        // 属性length控制线长
                    lineStyle: {       // 属性lineStyle控制线条样式
                        color: 'auto'
                    }
                },
                axisLabel: {
                    formatter:function(v){
                        switch (v + '') {
                            case '0' : return 'E';
                            case '1' : return 'Gas';
                            case '2' : return 'F';
                        }
                    }
                },
                splitLine: {           // 分隔线
                    length :15,         // 属性length控制线长
                    lineStyle: {       // 属性lineStyle（详见lineStyle）控制线条样式
                        color: 'auto'
                    }
                },
                pointer: {
                    width:2
                },
                title : {
                    show: false
                },
                detail : {
                    show: false
                },
                data:[{value: 0.5, name: 'gas'}]
            },
            {
                name:'水表',
                type:'gauge',
                center : ['75%', '50%'],    // 默认全局居中
                radius : '50%',
                min:0,
                max:2,
                startAngle:315,
                endAngle:225,
                splitNumber:2,
                axisLine: {            // 坐标轴线
                    lineStyle: {       // 属性lineStyle控制线条样式
                        color: [[0.2, '#ff4500'],[0.8, '#48b'],[1, '#228b22']],
                        width: 8
                    }
                },
                axisTick: {            // 坐标轴小标记
                    show: false
                },
                axisLabel: {
                    formatter:function(v){
                        switch (v + '') {
                            case '0' : return 'H';
                            case '1' : return 'Water';
                            case '2' : return 'C';
                        }
                    }
                },
                splitLine: {           // 分隔线
                    length :15,         // 属性length控制线长
                    lineStyle: {       // 属性lineStyle（详见lineStyle）控制线条样式
                        color: 'auto'
                    }
                },
                pointer: {
                    width:2
                },
                title : {
                    show: false
                },
                detail : {
                    show: false
                },
                data:[{value: 0.5, name: 'gas'}]
            }
        ]
    };
    gaugeChart.setOption(gaugeoption);
    $(window).resize(gaugeChart.resize);

    var funnelChart = echarts.init(document.getElementById("echarts-funnel-chart"));
    var funneloption = {
        title : {
            text: '漏斗图'
        },
        tooltip : {
            trigger: 'item',
            formatter: "{a} <br/>{b} : {c}%"
        },
        legend: {
            data : ['1000011','1000012','1000013','1000014','1000015']
        },
        calculable : true,
        series : [
            {
                name:'漏斗图',
                type:'funnel',
                width: '40%',
                data:[
                    {value:60, name:'1000010'},
                    {value:40, name:'100009'},
                    {value:20, name:'100008'},
                    {value:80, name:'100007'},
                    {value:100, name:'100006'}
                ]
            },
            {
                name:'金字塔',
                type:'funnel',
                x : '50%',
                sort : 'ascending',
                itemStyle: {
                    normal: {
                        // color: 各异,
                        label: {
                            position: 'left'
                        }
                    }
                },
                data:[
                    {value:60, name:'100001'},
                    {value:40, name:'100002'},
                    {value:20, name:'100003'},
                    {value:80, name:'100004'},
                    {value:100, name:'100005'}
                ]
            }
        ]
    };

    funnelChart.setOption(funneloption);
    $(window).resize(funnelChart.resize);

    //用户健康分析图----------------------------------------------------------------------------
    var dataArr = [{
        value: 91,
        name: '综合健康评分'
    }];
    var color = new echarts.graphic.LinearGradient(0, 0, 1, 0, [{
        offset: 0,
        color: '#5CF9FE' // 0% 处的颜色
    },
        {
            offset: 0.17,
            color: '#468EFD' // 100% 处的颜色
        },
        {
            offset: 0.9,
            color: '#468EFD' // 100% 处的颜色
        },
        {
            offset: 1,
            color: '#5CF9FE' // 100% 处的颜色
        }
    ]);
    var colorSet = [
        [0.91, color],
        [1, '#15337C']
    ];
    var rich = {
        white: {
            fontSize: 50,
            color: '#fff',
            fontWeight: '500',
            padding: [-150, 0, 0, 0]
        },
        bule: {
            fontSize: 120,
            fontFamily: 'DINBold',
            color: '#fff',
            fontWeight: '700',
            padding: [-120, 0, 0, 0],
        },
        radius: {
            width: 350,
            height: 80,
            // lineHeight:80,
            borderWidth: 1,
            borderColor: '#0092F2',
            fontSize: 50,
            color: '#fff',
            backgroundColor: '#1B215B',
            borderRadius: 20,
            textAlign: 'center',
        },
        size: {
            height: 400,
            padding: [100, 0, 0, 0]
        }
    }
    echarts.init(document.getElementById('user-health-chart')).setOption({
        backgroundColor: '#0E1327',
        tooltip: {
            formatter: "{a} <br/>{b} : {c}%"
        },

        series: [{ //内圆
            type: 'pie',
            radius: '85%',
            center: ['50%', '50%'],
            z: 0,
            itemStyle: {
                normal: {
                    color: new echarts.graphic.RadialGradient(.5, .5, 1, [{
                        offset: 0,
                        color: 'rgba(17,24,43,0)'
                    },
                        {
                            offset: .5,
                            // color: '#1E2B57'
                            color:'rgba(28,42,91,.6)'
                        },
                        {
                            offset: 1,
                            color: '#141C33',
                            // color:'rgba(17,24,43,0)'
                        }
                    ], false),
                    label: {
                        show: false
                    },
                    labelLine: {
                        show: false
                    }
                },
            },
            hoverAnimation: false,
            label: {
                show: false,
            },
            tooltip: {
                show: false
            },
            data: [100],
        },
            {
                type: 'gauge',
                name: '外层辅助',
                radius: '74%',
                startAngle: '225',
                endAngle: '-45',
                splitNumber: '100',
                pointer: {
                    show: false
                },
                detail: {
                    show: false,
                },
                data: [{
                    value: 1
                }],
                // data: [{value: 1, name: 90}],
                title: {
                    show: true,
                    offsetCenter: [0, 30],
                    textStyle: {
                        color: '#fff',
                        fontStyle: 'normal',
                        fontWeight: 'normal',
                        fontFamily: '微软雅黑',
                        fontSize: 20,
                    }
                },
                axisLine: {
                    show: true,
                    lineStyle: {
                        color: [
                            [1, '#00FFFF']
                        ],
                        width: 2,
                        opacity: 1
                    }
                },
                axisTick: {
                    show: false
                },
                splitLine: {
                    show: true,
                    length: 20,
                    lineStyle: {
                        color: '#051932',
                        width: 0,
                        type: 'solid',
                    },
                },
                axisLabel: {
                    show: false
                }
            },
            {
                type: 'gauge',
                radius: '70%',
                startAngle: '225',
                endAngle: '-45',
                pointer: {
                    show: false
                },
                detail: {
                    formatter: function(value) {
                        var num = Math.round(value);
                        return '{bule|' + num + '}{white|分}' + '{size|' + '}\n{radius|综合健康评分}';
                    },
                    rich: rich,
                    "offsetCenter": ['0%', "0%"],
                },
                data: dataArr,
                title: {
                    show: false,
                },
                axisLine: {
                    show: true,
                    lineStyle: {
                        color: colorSet,
                        width: 25,
                        // shadowBlur: 15,
                        // shadowColor: '#B0C4DE',
                        shadowOffsetX: 0,
                        shadowOffsetY: 0,
                        opacity: 1
                    }
                },
                axisTick: {
                    show: false
                },
                splitLine: {
                    show: false,
                    length: 25,
                    lineStyle: {
                        color: '#00377a',
                        width: 2,
                        type: 'solid',
                    },
                },
                axisLabel: {
                    show: false
                },
            },
            {
                name: '灰色内圈', //刻度背景
                type: 'gauge',
                z: 2,
                radius: '60%',
                startAngle: '225',
                endAngle: '-45',
                //center: ["50%", "75%"], //整体的位置设置
                axisLine: { // 坐标轴线
                    lineStyle: { // 属性lineStyle控制线条样式
                        color: [
                            [1, '#018DFF']
                        ],
                        width: 2,
                        opacity: 1, //刻度背景宽度
                    }
                },
                splitLine: {
                    show: false
                },
                // data: [{
                //     show: false,
                //     value: '80'
                // }], //作用不清楚
                axisLabel: {
                    show: false
                },
                pointer: {
                    show: false
                },
                axisTick: {
                    show: false
                },
                detail: {
                    show: 0
                }
            },
            {
                name: "白色圈刻度",
                type: "gauge",
                radius: "60%",
                startAngle: 225, //刻度起始
                endAngle: -45, //刻度结束
                z: 4,
                axisTick: {
                    show: false
                },
                splitLine: {
                    length: 16, //刻度节点线长度
                    lineStyle: {
                        width: 2,
                        color: 'rgba(1,244,255, 0.9)'
                    } //刻度节点线
                },
                axisLabel: {
                    color: 'rgba(255,255,255,0)',
                    fontSize: 12,
                }, //刻度节点文字颜色
                pointer: {
                    show: false
                },
                axisLine: {
                    lineStyle: {
                        opacity: 0
                    }
                },
                detail: {
                    show: false
                },
                data: [{
                    value: 0,
                    name: ""
                }]
            },
            { //内圆
                type: 'pie',
                radius: '56%',
                center: ['50%', '50%'],
                z: 1,
                itemStyle: {
                    normal: {
                        color: new echarts.graphic.RadialGradient(.5, .5, .8, [{
                            offset: 0,
                            color: '#4978EC'
                        },
                            {
                                offset: .5,
                                color: '#1E2B57'
                            },
                            {
                                offset: 1,
                                color: '#141F3D'
                            }
                        ], false),
                        label: {
                            show: false
                        },
                        labelLine: {
                            show: false
                        }
                    },
                },
                hoverAnimation: false,
                label: {
                    show: false,
                },
                tooltip: {
                    show: false
                },
                data: [100],
            },
        ]
    });




});
